{"backend": "tensorflow", "keras_version": "2.1.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "padding": "same", "trainable": true, "filters": 20, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_5", "padding": "same", "trainable": true, "filters": 24, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_9", "padding": "same", "trainable": true, "filters": 16, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [9, 9], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid"}}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "padding": "same", "trainable": true, "filters": 40, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "conv2d_6", "padding": "same", "trainable": true, "filters": 48, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"name": "conv2d_10", "padding": "same", "trainable": true, "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid"}}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "valid"}}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "valid"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "padding": "same", "trainable": true, "filters": 20, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"name": "conv2d_7", "padding": "same", "trainable": true, "filters": 24, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"name": "conv2d_11", "padding": "same", "trainable": true, "filters": 16, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "conv2d_4", "padding": "same", "trainable": true, "filters": 10, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "conv2d_8", "padding": "same", "trainable": true, "filters": 12, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "conv2d_12", "padding": "same", "trainable": true, "filters": 8, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["conv2d_8", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_1", "trainable": true}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "conv2d_13", "padding": "same", "trainable": true, "filters": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "name": "model_1", "output_layers": [["conv2d_13", 0, 0]], "input_layers": [["input_1", 0, 0]]}}